module.exports = {
  error: {
    uk: 'Неуспішний платіж. Некоректно заповнені дані',
    ru: '',
    en: ''
  },
  failure: {
    uk: 'Неуспішний платіж',
    ru: '',
    en: ''
  },
  reversed: {
    uk: 'Платіж повернений',
    ru: '',
    en: ''
  },
  subscribed: {
    uk: 'Підписка успішно оформлена',
    ru: '',
    en: ''
  },
  success: {
    uk: 'Успішний платіж',
    ru: '',
    en: ''
  },
  unsubscribed: {
    uk: 'Підписка успішно деактивована',
    ru: '',
    en: ''
  },
  '3ds_verify': {
    uk: 'Потрібна 3DS верифікація. Для завершення платежу, потрібно виконати 3ds_verify',
    ru: '',
    en: ''
  },
  captcha_verify: {
    uk: 'Очікується підтвердження captcha',
    ru: '',
    en: ''
  },
  cvv_verify: {
    uk: 'Потрібне введення CVV картки відправника.',
    ru: '',
    en: ''
  },
  ivr_verify: {
    uk: 'Очікується підтвердження дзвінком ivr',
    ru: '',
    en: ''
  },
  otp_verify: {
    uk: 'Потрібне OTP підтвердження клієнта. OTP пароль відправлений на номер телефону Клієнта.',
    ru: '',
    en: ''
  },
  password_verify: {
    uk: 'Очікується підтвердження пароля додатка Приват24',
    ru: '',
    en: ''
  },
  phone_verify: {
    uk: 'Очікується введення телефону клієнтом. Для завершення платежу, потрібно виконати phone_verify',
    ru: '',
    en: ''
  },
  pin_verify: {
    uk: 'Очікується підтвердження pin-code',
    ru: '',
    en: ''
  },
  receiver_verify: {
    uk: 'Потрібне введення даних одержувача. Для завершення платежу, потрібно виконати receiver_verify',
    ru: '',
    en: ''
  },
  sender_verify: {
    uk: 'Потрібне введення даних відправника. Для завершення платежу, потрібно виконати sender_verify',
    ru: '',
    en: ''
  },
  senderapp_verify: {
    uk: 'Очікується підтвердження в додатку Privat24',
    ru: '',
    en: ''
  },
  wait_qr: {
    uk: 'Очікується сканування QR-коду клієнтом',
    ru: '',
    en: ''
  },
  wait_sender: {
    uk: 'Очікується підтвердження оплати клієнтом в додатку Privat24/SENDER',
    ru: '',
    en: ''
  },
  p24_verify: {
    uk: 'Очікується завершення платежу в Приват24',
    ru: '',
    en: ''
  },
  mp_verify: {
    uk: 'Очікується завершення платежу в гаманці MasterPass',
    ru: '',
    en: ''
  },
  cash_wait: {
    uk: 'Очікується оплата готівкою в ТСО',
    ru: '',
    en: ''
  },
  hold_wait: {
    uk: 'Сума успішно заблокована на рахунку відправника',
    ru: '',
    en: ''
  },
  invoice_wait: {
    uk: 'Інвойс створений успішно, очікується оплата',
    ru: '',
    en: ''
  },
  prepared: {
    uk: 'Платіж створений, очікується його завершення відправником',
    ru: '',
    en: ''
  },
  processing: {
    uk: 'Платіж обробляється',
    ru: '',
    en: ''
  },
  wait_accept: {
    uk: 'Кошти з клієнта списані, але магазин ще не пройшов перевірку.',
    ru: '',
    en: ''
  },
  wait_card: {
    uk: 'Не встановлений спосіб відшкодування у одержувача',
    ru: '',
    en: ''
  },
  wait_compensation: {
    uk: 'Платіж успішний, буде зарахований в щодобовій проводці',
    ru: '',
    en: ''
  },
  wait_lc: {
    uk: 'Акредитив. Кошти з клієнта списані, очікується підтвердження доставки товару',
    ru: '',
    en: ''
  },
  wait_reserve: {
    uk: 'Грошові кошти за платежем зарезервовані для проведення повернення за раніше поданою заявкою',
    ru: '',
    en: ''
  },
  wait_secure: {
    uk: 'Платіж на перевірці',
    ru: '',
    en: ''
  },
  try_again: {
    uk: 'Оплата неуспішна. Клієнт може повторити спробу ще раз',
    ru: '',
    en: ''
  }
};
